Repository: arvianq-beep/BilimbdlerSchool
Catalog: lib/l10n/app_*.arb
Languages: kk, ru

source: Password
kk: Құпия сөз
ru: Пароль

source: Sign in
kk: Кіру
ru: Войти

source: Continue as guest
kk: Қонақ ретінде жалғастыру
ru: Продолжить как гость

# notMember
source: Not a member?
kk: Тіркелмегенсіз бе?
ru: Нет аккаунта?

source: Register now
kk: Қазір тіркелу
ru: Зарегистрируйтесь

source: Welcome!
kk: Қош келдіңіз!
ru: Добро пожаловать!

source: Sign out
kk: Шығу
ru: Выйти

# alreadyMember
source: Already have an account?
kk: Бұрын тіркелгенсіз бе?
ru: Уже есть аккаунт?

# loginNow
source: Log in
kk: Кіру
ru: Войти

source: Confirm password
kk: Құпия сөзді растау
ru: Подтвердите пароль

# weakPassword
source: Password must be at least 6 characters
kk: Құпия сөз кемінде 6 таңба болуы керек
ru: Пароль должен быть не менее 6 символов

# emailInUse
source: This email is already in use
kk: Бұл электрондық пошта бұрын қолданылған
ru: Этот email уже используется

# emailAlreadyInUse
source: This email is already in use
kk: Бұл электрондық пошта бұрын қолданылған
ru: Этот email уже используется

# invalidEmail
source: Invalid email address
kk: Жарамсыз электрондық пошта
ru: Некорректный email

# userNotFound
source: No user found with this email
kk: Осы поштамен пайдаланушы табылмады
ru: Пользователь не найден

source: Wrong password
kk: Қате құпия сөз
ru: Неверный пароль

# badEmailOrPassword
source: Wrong email or password
kk: Қате электрондық пошта не құпия сөз
ru: Неверный email или пароль

# tooManyRequests
source: Too many attempts, try again later
kk: Тым көп әрекет, кейінірек қайталап көріңіз
ru: Слишком много попыток, попробуйте позже

# unknownError
source: An unknown error occurred
kk: Белгісіз қате орын алды
ru: Неизвестная ошибка

# enterEmailPassword
source: Enter email and password
kk: Электрондық пошта мен құпия сөзді енгізіңіз
ru: Введите email и пароль

# passwordsNotMatch
source: Passwords do not match
kk: Құпия сөздер сәйкес келмейді
ru: Пароли не совпадают

# verificationEmailSent
source: Verification email sent to {email}
kk: Растау хаты {email} поштасына жіберілді
ru: Письмо для подтверждения отправлено на {email}

# verifyYourEmail
source: Please verify your email before logging in
kk: Кіру алдында электрондық поштаңызды растаңыз
ru: Подтвердите email перед входом

source: Forgot password?
kk: Құпия сөзді ұмыттыңыз ба?
ru: Забыли пароль?

# pleaseEnterEmail
source: Please enter your email
kk: Электрондық поштаңызды енгізіңіз
ru: Введите email

# resetEmailSent
source: Password reset email sent to {email}
kk: Құпия сөзді қалпына келтіру хаты {email} поштасына жіберілді
ru: Письмо для сброса пароля отправлено на {email}

# resendVerification
source: Resend verification email
kk: Растау хатын қайта жіберу
ru: Отправить письмо повторно

source: Verification email resent
kk: Растау хаты қайта жіберілді
ru: Письмо повторно отправлено

# guestIdDisplay
source: Guest ID: {id}
kk: Қонақ ID: {id}
ru: Гостевой ID: {id}

# userIdDisplay
source: User ID: {id}
kk: Пайдаланушы ID: {id}
ru: ID пользователя: {id}

# profileTitle
source: Profile
kk: Профиль
ru: Профиль

source: First name
kk: Аты
ru: Имя

source: Last name
kk: Тегі
ru: Фамилия

source: Save
kk: Сақтау
ru: Сохранить

source: Saved
kk: Сақталды
ru: Сохранено

# enterNameOrSurname
source: Enter first or last name
kk: Аты немесе тегін енгізіңіз
ru: Введите имя или фамилию

# youCanSearchByName
source: You can search users by first/last name.
kk: Пайдаланушыларды аты/тегі бойынша іздей аласыз.
ru: Можно искать пользователей по имени/фамилии.

source: Start game
kk: Ойынды бастау
ru: Начать игру

source: Subjects
kk: Пәндер
ru: Предметы

source: Settings
kk: Баптаулар
ru: Настройки

source: Sound
kk: Дыбыс
ru: Звук

source: Vibration
kk: Діріл
ru: Вибрация

source: Theme
kk: Тақырып
ru: Тема

# chooseSubject
source: Choose a subject
kk: Пәнді таңдаңыз
ru: Выберите предмет

source: Toggle theme
kk: Тақырыпты ауыстыру
ru: Переключить тему

source: Geography
kk: География
ru: География

source: Physical geography
kk: Физикалық география
ru: Физическая география

source: Economic geography
kk: Экономикалық география
ru: Экономическая география

# comingSoon
source: Coming soon: {title}
kk: Жақында: {title}
ru: Скоро: {title}

source: Mountains
kk: Таулар
ru: Горы

source: Lakes
kk: Көлдер
ru: Озёра

# deserts
source: Regions ph
kk: Физ гео Аудандар
ru: Физ регоины

source: Rivers
kk: Өзендер
ru: Реки

source: Reserves
kk: Қорықтар
ru: Заповедники

# testLabel
source: Test
kk: Тест
ru: Тест

source: Regions
kk: Облыстар
ru: Регионы

source: Cities
kk: Қалалар
ru: Города

source: Symbols
kk: Кең орындар
ru: Условные знаки

source: Factories
kk: Зауыттар
ru: Заводы

source: Symbols test
kk: Шартты белгілер
ru: Тест по знакам

source: Join by code
kk: Код арқылы кіру
ru: Войти по коду

source: Enter code
kk: Кодты енгізіңіз
ru: Введите код

# btnJoin
source: Join
kk: Кіру
ru: Войти

# btnCancel
source: Cancel
kk: Бас тарту
ru: Отмена

# howToPlayTitle
source: How to play?
kk: Қалай ойнаймыз?
ru: Как играть?

# howToPlayBody
source: Solo — go straight to the subject. Group — a room will be created and you’ll start together.
kk: Жеке — бірден пәнге өтесіз. Топ — бөлме құрылып, бәріңіз бірге бастайсыз.
ru: Соло — переходите сразу к предмету. Группа — создаётся комната и вы стартуете вместе.

# modeSolo
source: Solo
kk: Жеке
ru: Соло

# modeGroup
source: Group
kk: Топпен
ru: Группа

# chooseParticipantsTitle
source: How many participants?
kk: Қатысушылар саны?
ru: Сколько участников?

# btnOk
source: OK
kk: ОК
ru: ОК

# waitingRoomTitle
source: Waiting room
kk: Күту бөлмесі
ru: Комната ожидания

source: Room deleted
kk: Бөлме өшірілді
ru: Комната удалена

source: Code copied
kk: Код көшірілді
ru: Код скопирован

# roomOpen
source: Open
kk: Ашық
ru: Открыта

# roomClosed
source: Closed
kk: Жабық
ru: Закрыта

# membersCount
source: Members: {count} / {max}
kk: Қатысушылар: {count} / {max}
ru: Участники: {count} / {max}

# statusLabel
source: Status
kk: Күйі
ru: Статус

# statusWaiting
source: waiting
kk: күту
ru: ожидание

# statusPlaying
source: playing
kk: ойында
ru: игра

source: Leave
kk: Шығу
ru: Выйти

source: Choose game
kk: Ойынды таңдау
ru: Выберите игру

# createRoomFailed
source: Couldn't create room
kk: Бөлмені құру мүмкін болмады
ru: Не удалось создать комнату

# startGameFailed
source: Couldn't start the game
kk: Ойынды іске қосу мүмкін болмады
ru: Не удалось запустить игру

source: Room not found
kk: Бөлме табылмады
ru: Комната не найдена

# roomAlreadyStarted
source: The game has already started
kk: Ойын басталып кетті
ru: Игра уже началась

source: Room is closed
kk: Бөлме жабық
ru: Комната закрыта

# roomIsFull
source: No seats left
kk: Бос орын жоқ
ru: Свободных мест нет

# codeLabel
source: Code: {code}
kk: Код: {code}
ru: Код: {code}

# createRoomTitle
source: Create room
kk: Бөлме құру
ru: Создать комнату

source: Participants limit
kk: Қатысушылар шегі
ru: Лимит участников

# btnCreate
source: Create
kk: Құру
ru: Создать

# shareCodeHint
source: After creating, share the room code from the lobby.
kk: Құрғаннан кейін, лоббиден бөлме кодын бөлісіңіз.
ru: После создания поделитесь кодом комнаты из лобби.

source: Owner
kk: Иесі
ru: Владелец

source: Member
kk: Мүше
ru: Участник

# noMembersYet
source: No one yet
kk: Әзірге ешкім жоқ
ru: Пока никого

# joinFailed
source: Couldn't join
kk: Қосыла алмады
ru: Не удалось присоединиться

# codeGenerationFailed
source: Couldn't generate a code
kk: Код жасау сәтсіз аяқталды
ru: Не удалось сгенерировать код

# gameTitle
source: Game: {id}
kk: Ойын: {id}
ru: Игра: {id}

# gameLaunched
source: Started game "{gameId}" for subject "{subject}"
kk: «{subject}» пәні бойынша «{gameId}» ойыны басталды
ru: Запущена игра "{gameId}" для предмета "{subject}"

source: Markets
kk: Нарықтар
ru: Рынки

source: GDP quiz
kk: ЖІӨ викторинасы
ru: Викторина по ВВП

source: Trade routes
kk: Сауда жолдары
ru: Торговые пути

source: Industry
kk: Өнеркәсіп
ru: Промышленность

source: Resources
kk: Ресурстар
ru: Ресурсы

source: Population
kk: Халық
ru: Население

source: Capitals
kk: Астаналар
ru: Столицы

source: Flags
kk: Тулар
ru: Флаги

source: Climate
kk: Климат
ru: Климат

# citiesEgTitle
source: Economic geography: Cities
kk: Экономикалық география: Қалалар
ru: Экономическая география: Города

source: Rules
kk: Ережелер
ru: Правила

# findCityPrompt
source: Find the city:
kk: Қаланы табыңыз:
ru: Найдите город:

# scoreDisplay
source: Score: {score}
kk: Ұпай: {score}
ru: Счёт: {score}

# citiesEgFinishTitle
source: Done!
kk: Аяқталды!
ru: Готово!

# resultDisplay
source: Your result: {score} / {total}
kk: Нәтиже: {score} / {total}
ru: Ваш результат: {score} / {total}

source: Play again
kk: Қайта ойнау
ru: Сыграть ещё

# citiesEgRulesText
source: The screen shows a city name. Tap the corresponding square on the map. +1 point for a correct answer. Wrong taps highlight in red. Go through all cities and try again.
kk: Картадан берілген қаланы табыңыз. Дұрыс жауап үшін +1 ұпай беріледі.
ru: На экране показано название города. Нажмите соответствующий квадрат на карте. +1 балл за правильный ответ. Ошибочные нажатия подсвечиваются красным. Пройдите все города и попробуйте снова.

# cityAstana
source: Astana
kk: Астана
ru: Астана

# cityAlmaty
source: Almaty
kk: Алматы
ru: Алматы

# cityShymkent
source: Shymkent
kk: Шымкент
ru: Шымкент

# cityKaraganda
source: Karaganda
kk: Қарағанды
ru: Караганда

# cityAktobe
source: Aktobe
kk: Ақтөбе
ru: Актобе

# cityTaraz
source: Taraz
kk: Тараз
ru: Тараз

# cityPavlodar
source: Pavlodar
kk: Павлодар
ru: Павлодар

# cityOskemen
source: Oskemen
kk: Өскемен
ru: Усть-Каменогорск

# citySemey
source: Semey
kk: Семей
ru: Семей

# cityKostanay
source: Kostanay
kk: Қостанай
ru: Костанай

# cityAtyrau
source: Atyrau
kk: Атырау
ru: Атырау

# cityKyzylorda
source: Kyzylorda
kk: Қызылорда
ru: Кызылорда

# cityOral
source: Oral
kk: Орал
ru: Орал

# cityPetropavl
source: Petropavl
kk: Петропавл
ru: Петропавл

# cityEkibastuz
source: Ekibastuz
kk: Екібастұз
ru: Экибастуз

# cityZhezkazgan
source: Zhezkazgan
kk: Жезқазған
ru: Жезказган

# cityTemirtau
source: Temirtau
kk: Теміртау
ru: Темиртау

# cityKokshetau
source: Kokshetau
kk: Көкшетау
ru: Кокшетау

# cityTurkistan
source: Turkistan
kk: Түркістан
ru: Туркестан

# cityTaldykorgan
source: Taldykorgan
kk: Талдықорған
ru: Талдыкорган

# factoriesTestTitle
source: Test: Metallurgy
kk: Зауыттар
ru: Тест: Металлургия

# factoriesQ1
source: Where is the Titanium–Magnesium Plant located?
kk: Титан-магний комбинаты қай қалада орналасқан?
ru: Где находится Титано-магниевый завод?

# factoriesQ1A1
source: Pavlodar
kk: Павлодар
ru: Павлодар

# factoriesQ1A2
source: Oskemen
kk: Өскемен
ru: Усть-Каменогорск

# factoriesQ1A3
source: Ridder
kk: Риддер
ru: Риддер

# factoriesQ1A4
source: Zhezkazgan
kk: Жезқазған
ru: Жезказган

# factoriesQ2
source: Which plant is located in Pavlodar?
kk: Павлодар қаласында қай зауыт орналасқан?
ru: Какой завод расположен в Павлодаре?

# factoriesQ2A1
source: Electrolysis plant
kk: Электролиз зауыты
ru: Электролизный завод

# factoriesQ2A2
source: Polymetal plant
kk: Полиметалл комбинаты
ru: Полиметаллический завод

# factoriesQ2A3
source: Copper smelter
kk: Мыс қорыту зауыты
ru: Медеплавильный завод

# factoriesQ2A4
source: Lead–zinc plant
kk: Қорғасын-мырыш комбинаты
ru: Свинцово-цинковый завод

# factoriesQ3
source: Metallurgical giant in Temirtau?
kk: Теміртаудағы металлургиялық алып?
ru: Металлургический гигант в Темиртау?

# factoriesQ3A1
source: Balkhash copper plant
kk: Балқаш мыс зауыты
ru: Балхашский медеплавильный

# factoriesQ3A3
source: Alumina plant
kk: Глинозем зауыты
ru: Глинозёмный завод

# factoriesQ3A4
source: Aktobe ferroalloy plant
kk: Ақтөбе ферроқорытпа зауыты
ru: Актюбинский ферросплавный

# questionOfTotal
source: Question {current} of {total}
kk: Сұрақ {current}/{total}
ru: Вопрос {current} из {total}

# factoriesQ4
source: Which city does NOT have a ferroalloy plant?
kk: Ферроқорытпа зауыты қай қалада жоқ?
ru: В каком городе НЕТ ферросплавного завода?

# factoriesQ4A1
source: Aktobe
kk: Ақтөбе
ru: Актобе

# factoriesQ4A2
source: Aksu (Pavlodar)
kk: Ақсу (Павлодар)
ru: Аксу (Павлодар)

# factoriesQ4A3
source: Taraz
kk: Тараз
ru: Тараз

# factoriesQ4A4
source: Zhezkazgan
kk: Жезқазған
ru: Жезказган

# factoriesQ5
source: Where is a copper smelter located?
kk: Мыс қорыту зауыты қай қалада?
ru: Где расположен медеплавильный завод?

# factoriesQ5A1
source: Balkhash
kk: Балқаш
ru: Балхаш

# factoriesQ5A2
source: Aktobe
kk: Ақтөбе
ru: Актобе

# factoriesQ5A3
source: Ridder
kk: Риддер
ru: Риддер

# factoriesQ5A4
source: Atyrau
kk: Атырау
ru: Атырау

# factoriesQ6
source: Lead–zinc combine is in which city?
kk: Қорғасын-мырыш комбинаты қай қалада?
ru: Свинцово-цинковый комбинат — в каком городе?

# factoriesQ6A1
source: Oskemen
kk: Өскемен
ru: Усть-Каменогорск

# factoriesQ6A2
source: Atyrau
kk: Атырау
ru: Атырау

# factoriesQ6A3
source: Taraz
kk: Тараз
ru: Тараз

# factoriesQ6A4
source: Almaty
kk: Алматы
ru: Алматы

# factoriesQ7
source: Polymetal plant is located in:
kk: Полиметалл комбинаты қай қалада?
ru: Полиметаллический завод расположен в:

# factoriesQ7A1
source: Oskemen
kk: Өскемен
ru: Усть-Каменогорск

# factoriesQ7A2
source: Pavlodar
kk: Павлодар
ru: Павлодар

# factoriesQ7A3
source: Ridder
kk: Риддер
ru: Риддер

# factoriesQ7A4
source: Aktobe
kk: Ақтөбе
ru: Актобе

# resultsTitle
source: Results
kk: Нәтижелер
ru: Результат

source: Room
kk: Бөлме
ru: Комната

source: Finished
kk: Дайын
ru: Завершено

# scoreShort
source: Score
kk: Ұпай
ru: Счёт

source: Back
kk: Артқа
ru: Назад

# toMenu
source: Home
kk: Басты мәзір
ru: Домой

source: Test finished
kk: Тест аяқталды
ru: Тест завершён

# result
source: Result: {score} / {total}
kk: Нәтиже
ru: Результат: {score} из {total}

source: Next game
kk: Келесі ойын
ru: Следующая игра

# symbolsQuizTitle
source: Symbols quiz
kk: Таңбалар тесті
ru: Тест по знакам

source: Reset
kk: Қалпына келтіру
ru: Сбросить

source: Restart
kk: Қайта бастау
ru: Сброс

source: Close
kk: Жабу
ru: Закрыть

# score
source: Score: {value}
kk: Ұпай
ru: Очки: {value}

source: Next
kk: Келесі
ru: Далее

source: Show result
kk: Нәтижені көрсету
ru: Показать результат

# symbolsResultTitle
source: Result
kk: Нәтиже
ru: Результат

# correctAnswers
source: Correct
kk: Дұрыс
ru: Верно

# pgRegionsTitle
source: Physical-geographic regions
ru: Физ.-геогр. районы

# pgFindPrefix
source: Find:
ru: Найдите:

# pgRestart
source: Restart
ru: Заново

# pgScore
source: Score: {value}
ru: Счёт: {value}

# pgMapNotFound
source: Map not found
ru: Карта не найдена

# pgCalibrateOn
source: Calibration: ON
ru: Калибровка: ВКЛ

# pgCalibrateOff
source: Calibration: off
ru: Калибровка: выкл

# pgNudgeSaved
source: Adjustment for {name}: {delta}
ru: Подгонка для {name}: {delta}

# regEastEuropePlain
source: East European Plain
ru: Шығыс Еуропа жазығы

# regNorthKazakhPlain
source: North Kazakh Plain
ru: Солтүстік Қазақ жазығы

# regTuranLowland
source: Turan Lowland
ru: Тұран жазығы

# regUralMugalzhar
source: Ural (Mugalzhar)
ru: Орал (Мұғалжар)

# regSaryarka
source: Saryarka
ru: Сарыарқа

# regAltai
source: Altai
ru: Алтай

# regSaurTarbagatai
source: Saur–Tarbagatai
ru: Сауыр-Тарбағатай

# regZhetysuAlatau
source: Zhetysu Alatau
ru: Жетісу Алатауы

# regTienShan
source: Tian Shan
ru: Тянь-Шань

# mountainsTitle
source: Mountains of Kazakhstan
ru: Горы Казахстана

# findRange
source: Find the range:
ru: Найдите хребет:

source: Game finished
ru: Игра завершена

source: OK
ru: Ок

source: Map not found
ru: Карта не найдена

# mountainIleAlatau
source: Ile Alatau (Trans-Ili Alatau)
ru: Иле Алатау

# mountainTienShan
source: Tian Shan
ru: Тянь-Шань

# mountainZhetysuAlatau
source: Zhetysu (Dzungarian) Alatau
ru: Жетысу Алатауы

# mountainAltai
source: Altai
ru: Алтай

# mountainSauyrTarbagatai
source: Sauyr–Tarbagatai
ru: Сауыр-Тарбагатай

# mountainBayanaul
source: Bayanaul
ru: Баянаул

# mountainKarkaraly
source: Karkaraly
ru: Каркаралы

# mountainUlytau
source: Ulytau
ru: Улытау

# mountainKokshetau
source: Kokshetau Hills
ru: Кокшетау горы

# mountainKaratau
source: Karatau Range
ru: Каратау жотасы

# mountainMugodzhary
source: Mugodzhary
ru: Мугоджары

# mountainMangystau
source: Mangystau Mountains
ru: Мангистауские горы

# mountainKalba
source: Kalba Range
ru: Калба жотасы

source: Email
kk: Электрондық пошта

# factoriesQ3A2
source: Ispat-Karmet (ArcelorMittal)
kk: Испат-Кармет (АрселорМиттал)
